tap "altinity/clickhouse"
tap "anchore/grype"
tap "argoproj/tap"
tap "buildkite/buildkite"
tap "felixkratz/formulae"
tap "homebrew/cask-fonts"
tap "mediosz/tap"
tap "microsoft/mssql-release"
tap "nikitabobko/tap"
tap "peonping/tap"

brew "aws-vault", link: false
brew "awscli"
brew "buf"
brew "cairo"
brew "claude-squad"
brew "direnv"
brew "docker"
brew "dotnet"
brew "fzf"
brew "gh"
brew "ghz"
brew "gitversion"
brew "gnupg"
brew "go@1.21"
brew "pkgconf"
brew "gobject-introspection"
brew "golines"
brew "grype"
brew "helm"
brew "htop"
brew "jq"
brew "just"
brew "k9s"
brew "kafka", restart_service: :changed
brew "kcat"
brew "kubernetes-cli"
brew "libyaml"
brew "liquibase"
brew "minikube"
brew "mono"
brew "neovim"
brew "node"
brew "nvm"
brew "pango"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "spicetify-cli"
brew "stern"
brew "stow"
brew "terraform"
brew "tmux"
brew "trino"
brew "trunk", link: false
brew "unixodbc"
brew "uv"
brew "zig"
brew "zoxide"
brew "zrok"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "buildkite/buildkite/bk@3"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"
brew "peonping/tap/peon-ping"

cask "nikitabobko/tap/aerospace"
cask "airflow"
cask "aws-vault-binary"
cask "claude-code@latest"
cask "clickhouse"
cask "codex"
cask "cursor"
cask "dotnet-sdk"
cask "dotnet-sdk@8"
cask "easy-move+resize"
cask "font-hack-nerd-font"
cask "raycast"
cask "redis-insight"
cask "mediosz/tap/swipeaerospace"
cask "trunk-io"

go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

krew "ctx"
krew "krew"
krew "ns"

npm "corepack"
npm "postman-cli"
npm "write-good"
